2024-11-05/app/controllers/user_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["username", "hoge"], ["password_digest", "[FILTERED]"], ["created_at", "2024-11-04 23:50:07.276840"], ["updated_at", "2024-11-04 23:50:07.276840"]]
---
  def create
    User.create!(username:"hoge", password: "foobar", password_confirmation: "foobar")